
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 0 to change, 5 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.POSTGRES-HOST-V15
  * azurerm_key_vault_secret.POSTGRES-PASS-V15
  * azurerm_key_vault_secret.POSTGRES-USER-V15
* Delete
  * azurerm_key_vault_secret.POSTGRES-DATABASE[0]
  * azurerm_key_vault_secret.POSTGRES-HOST[0]
  * azurerm_key_vault_secret.POSTGRES-PASS[0]
  * azurerm_key_vault_secret.POSTGRES-PORT[0]
  * azurerm_key_vault_secret.POSTGRES-USER[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-DATABASE[0] will be destroyed
  # (because index [0] is out of range for count)
  # (moved from azurerm_key_vault_secret.POSTGRES-DATABASE)
  - resource "azurerm_key_vault_secret" "POSTGRES-DATABASE" {
      - id                      = "https://ts-aat.vault.azure.net/secrets/translation-service-POSTGRES-DATABASE/7dfd578d1e7046398e6a093d3089c60e" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ts-shared-aat/providers/Microsoft.KeyVault/vaults/ts-aat" -> null
      - name                    = "translation-service-POSTGRES-DATABASE" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ts-shared-aat/providers/Microsoft.KeyVault/vaults/ts-aat/secrets/translation-service-POSTGRES-DATABASE/versions/7dfd578d1e7046398e6a093d3089c60e" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ts-shared-aat/providers/Microsoft.KeyVault/vaults/ts-aat/secrets/translation-service-POSTGRES-DATABASE" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "7dfd578d1e7046398e6a093d3089c60e" -> null
      - versionless_id          = "https://ts-aat.vault.azure.net/secrets/translation-service-POSTGRES-DATABASE" -> null
    }

  # azurerm_key_vault_secret.POSTGRES-HOST[0] will be destroyed
  # (because index [0] is out of range for count)
  # (moved from azurerm_key_vault_secret.POSTGRES-HOST)
  - resource "azurerm_key_vault_secret" "POSTGRES-HOST" {
      - id                      = "https://ts-aat.vault.azure.net/secrets/translation-service-POSTGRES-HOST/258abea1d87b4c1894fe690f078ce674" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ts-shared-aat/providers/Microsoft.KeyVault/vaults/ts-aat" -> null
      - name                    = "translation-service-POSTGRES-HOST" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ts-shared-aat/providers/Microsoft.KeyVault/vaults/ts-aat/secrets/translation-service-POSTGRES-HOST/versions/258abea1d87b4c1894fe690f078ce674" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ts-shared-aat/providers/Microsoft.KeyVault/vaults/ts-aat/secrets/translation-service-POSTGRES-HOST" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "258abea1d87b4c1894fe690f078ce674" -> null
      - versionless_id          = "https://ts-aat.vault.azure.net/secrets/translation-service-POSTGRES-HOST" -> null
    }

  # azurerm_key_vault_secret.POSTGRES-HOST-V15 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-HOST-V15" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ts-shared-aat/providers/Microsoft.KeyVault/vaults/ts-aat"
      + name                    = "translation-service-POSTGRES-HOST-V15"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-PASS[0] will be destroyed
  # (because index [0] is out of range for count)
  # (moved from azurerm_key_vault_secret.POSTGRES-PASS)
  - resource "azurerm_key_vault_secret" "POSTGRES-PASS" {
      - id                      = "https://ts-aat.vault.azure.net/secrets/translation-service-POSTGRES-PASS/e64d9fa3d3c74478b58f2801c48a7b89" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ts-shared-aat/providers/Microsoft.KeyVault/vaults/ts-aat" -> null
      - name                    = "translation-service-POSTGRES-PASS" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ts-shared-aat/providers/Microsoft.KeyVault/vaults/ts-aat/secrets/translation-service-POSTGRES-PASS/versions/e64d9fa3d3c74478b58f2801c48a7b89" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ts-shared-aat/providers/Microsoft.KeyVault/vaults/ts-aat/secrets/translation-service-POSTGRES-PASS" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "e64d9fa3d3c74478b58f2801c48a7b89" -> null
      - versionless_id          = "https://ts-aat.vault.azure.net/secrets/translation-service-POSTGRES-PASS" -> null
    }

  # azurerm_key_vault_secret.POSTGRES-PASS-V15 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-PASS-V15" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ts-shared-aat/providers/Microsoft.KeyVault/vaults/ts-aat"
      + name                    = "translation-service-POSTGRES-PASS-V15"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-PORT[0] will be destroyed
  # (because index [0] is out of range for count)
  # (moved from azurerm_key_vault_secret.POSTGRES-PORT)
  - resource "azurerm_key_vault_secret" "POSTGRES-PORT" {
      - id                      = "https://ts-aat.vault.azure.net/secrets/translation-service-POSTGRES-PORT/1352a69dba3843ccb47b45ddac9ae2b5" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ts-shared-aat/providers/Microsoft.KeyVault/vaults/ts-aat" -> null
      - name                    = "translation-service-POSTGRES-PORT" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ts-shared-aat/providers/Microsoft.KeyVault/vaults/ts-aat/secrets/translation-service-POSTGRES-PORT/versions/1352a69dba3843ccb47b45ddac9ae2b5" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ts-shared-aat/providers/Microsoft.KeyVault/vaults/ts-aat/secrets/translation-service-POSTGRES-PORT" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "1352a69dba3843ccb47b45ddac9ae2b5" -> null
      - versionless_id          = "https://ts-aat.vault.azure.net/secrets/translation-service-POSTGRES-PORT" -> null
    }

  # azurerm_key_vault_secret.POSTGRES-USER[0] will be destroyed
  # (because index [0] is out of range for count)
  # (moved from azurerm_key_vault_secret.POSTGRES-USER)
  - resource "azurerm_key_vault_secret" "POSTGRES-USER" {
      - id                      = "https://ts-aat.vault.azure.net/secrets/translation-service-POSTGRES-USER/44b93d8bfc9541c4bc8fbbc31315df01" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ts-shared-aat/providers/Microsoft.KeyVault/vaults/ts-aat" -> null
      - name                    = "translation-service-POSTGRES-USER" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ts-shared-aat/providers/Microsoft.KeyVault/vaults/ts-aat/secrets/translation-service-POSTGRES-USER/versions/44b93d8bfc9541c4bc8fbbc31315df01" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ts-shared-aat/providers/Microsoft.KeyVault/vaults/ts-aat/secrets/translation-service-POSTGRES-USER" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "44b93d8bfc9541c4bc8fbbc31315df01" -> null
      - versionless_id          = "https://ts-aat.vault.azure.net/secrets/translation-service-POSTGRES-USER" -> null
    }

  # azurerm_key_vault_secret.POSTGRES-USER-V15 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-USER-V15" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ts-shared-aat/providers/Microsoft.KeyVault/vaults/ts-aat"
      + name                    = "translation-service-POSTGRES-USER-V15"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 3 to add, 0 to change, 5 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":269,"Program":"tfcmt","SHA1":"","Vars":{}} -->